# Ch3.3 Handling Missing Data

In [1]:
import numpy as np
import pandas as pd

### Detecting null values

In [2]:
data = pd.Series([1, np.nan, 'hello', None])

In [3]:
data.isnull().values.any()

True

In [5]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [10]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [12]:
data = pd.Series([1, np.nan, 4, None])

In [13]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

### Dropping null values

For a ``Series``

In [14]:
data.dropna()

0    1.0
2    4.0
dtype: float64

For a ``DataFrame``

In [7]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

By default, ``dropna()`` will drop all rows in which *any* null value is present:

In [8]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [9]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [10]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [11]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [12]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

### Filling null values

For ``Series``

In [3]:
import pandas as pd
import numpy as np
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

fill NA entries with a single value, such as zero:

In [4]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

specify a forward-fill to propagate the previous value forward:

In [15]:
# forward-fill
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [16]:
# back-fill
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

For ``DataFrame``

In [17]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [18]:
type(df.iloc[1])

pandas.core.series.Series

In [19]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [20]:
df.fillna(method='ffill')

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  2.0  4.0  6 NaN